import re


def pattern_intent_combine():
    # pattern_repair = "((((我)(想要|(想|要)))?(报修|报事))?)((一下|下)?)"
    pattern_repair = "((((我)(想要|(想|要)))?(报修|报事))?)((一下|下)?)"
    pattern_complaint = "((((我)(想要|(想|要)))?(投诉|建议))?)((一下|下)?)"
    pattern_quary = "((((我)(想要|(想|要)))?)((帮)(我|忙)?)?)(((查)(找|询|看|查)?){1,2}|((找){1,2})|((搜)(搜|索)?)|(打开))((一下|下)?)"
    pattern_buy = "(((我)?((想)(要)?|(要))?)?)((((购)?(买))|(看){1,2}|((搜){1,2}(索)?))?)(一搜)?((一)?(下))?"

    all_str = "((我)?(想要|(想|要)))?((帮)(我|忙)?)?((((报修|报事)|(投诉|建议))?)(((查)(找|询|看|查)?){1,2}|((找){1,2})|((搜)(搜|索)?)|(打开)|((购)?(买)))?)(一下|下)?"
    # qwqw = "^(((((我)?(想要|(想|要))?)?))(((帮)(我|忙)?)?)((查(找|询|看|查)?){1,2}|找{1,2}|搜(搜|索)?(一搜)?|打开|购?买|((报修|报事)|(投诉|建议))?)((一下|下)?))"
    pattern_all = "^(((((我)?(想要|(想|要))?)?)((帮)(我|忙)?)?)((查(找|询|看|查)?){1,2}|找{1,2}|搜(搜|索)?(一搜)?|打开|购?买|((报修|报事)|(投诉|建议))?)((一下|下)?))"
    # return pattern_complaint + '|' + pattern_repair + '|' + pattern_quary + '|' + pattern_buy
    return pattern_all


def pattern_intent_divide():
    pattern_dict = {
        # 'pattern_greet': "(((你|您|上午|下午|晚上|早上|中午)?)(好)(啊?))?",
        # 'pattern_greet': "((((你|您|上午|下午|晚上|早上|中午)?)(好)(啊?))?(晚安|早安|午安)?)?",
        'pattern_greet': "(((((你|您|上午|下午|晚上|早上|中午|傍晚|早晨)?)(好)(啊?))?(晚安|早安|午安)?){1,2})?",

        'pattern_repair': "^(((((我)?((想)(要)?|(要))?)?((报修(报事)?)|(报事(报修)?)))?)((一下|下)?))",
        'pattern_complaint': "^(((((我)?((想)(要)?|(要))?)?((投诉(建议)?)|(建议(投诉)?)))?)((一下|下)?))",
        'pattern_quary': "^(((((我)?((想)(要)?|(要))?)?)((帮)(我|忙)?)?)"
                         "((查(找|询|看|查)?){1,2}|看|找{1,2}|搜(搜|索)?(一搜)?|打开)"
                         "((一下|下)?))?",
        # 'pattern_buy': "^((((我)?((想)(要)?|(要))?)?)((购)?(买)))",
        'pattern_buy': "^(((((我)?((想)(要)?|(要))?)?((购)?(买)))?))",
        'pattern_combine': "^(((((我)?(想要|(想|要))?)?)((帮)(我|忙)?)?)"
                           "((查(找|询|看|查)?){1,2}|找{1,2}|搜(搜|索)?(一搜)?|打开|购?买|((报修|报事)|(投诉|建议))?)((一下|下)?))"
    }
    return pattern_dict


def pattern_greet():
    greet_pattern = "((大家|你|您)?(好)(啊)?){1,2}"

    return greet_pattern


if __name__ == '__main__':
    input = '你好我想要投诉物业服务不好'
    # input = "你好我要投诉"
    # input = "大家好我要投诉"
    # input = "您好我要投诉"
    pa_str = pattern_greet()
    com_pat = re.compile(pa_str)
    result = com_pat.search(input).group()
    print(result)
