# -*- encoding=utf-8 -*-
"""
2020-04-27:增加词库
账单	物业缴费
报修单	报修/报事工单
报事单	报修/报事工单
投诉单	投诉/建议工单
建议单	投诉/建议工单
找一下	查询
投诉一下	投诉
建议一下	建议
"""
import configparser
import sys
import os
from collections import Counter
curPath = os.path.abspath(os.path.dirname(__file__))
rootPath = os.path.split(curPath)[0]
sys.path.append(os.path.split(rootPath)[0])
sys.path.append(rootPath)


class ConfigValue:
    """
    配置文件类
    """
    # 项目路径
    # rootDir = os.path.split(os.path.realpath(__file__))[0]
    # config.ini文件路径
    # configFilePath = os.path.join(rootDir, 'config.ini')
    def __init__(self, rootdir):
        configfilepath = os.path.join(rootdir, 'config.ini')
        self.config = configparser.ConfigParser()
        self.config.read(configfilepath)
        # print(configFilePath)

    def get_config_values(self, section_argv, arglist):
        """
        根据传入的section获取对应的value
        :param section_argv: ini配置文件中用[]标识的内容
        :return:
        """
        # return config.items(section=section)

        # arglist = ['ip', 'user', 'password', 'db', 'envIp']
        # if section_argv == 'dbtable':
        #     arglist = ['order_table', 'rec_table', 'filter_table']

        config_result = {}
        for option in arglist:
            if option == 'envIp':
                section = 'storeinterface'
            else:
                section = '%s' % section_argv
            config_result[option] = self.config.get(section=section, option=option)

        return config_result

    def get_config_values_list(self, section_argv, arglist):
        config_result = []
        for option in arglist:
            if option == 'envIp':
                section = 'storeinterface'
            else:
                section = '%s' % section_argv
            config_result = config_result + str(self.config.get(section=section, option=option)).split(',')

        return config_result

    def get_sections_all(self):
        return self.config.sections()

    def get_option(self, section):

        return self.config.options(section)

    def get_key_values(self, section):

        return self.config.items(section)


def get_word_config(file_path):
    conf = ConfigValue(file_path)
    word_key = conf.get_sections_all()
    words_dir = {}
    for word in word_key:
        arglist = conf.get_option(word)
        words_dir[word] = conf.get_config_values_list(word, arglist)
    return words_dir


def get_word_memory():
    """
    :return: word_dir
    """
    intend_word = {'repairs': ['我要报修', '报修', '报事'],
                   'complain': ['我要投诉', '投诉', '建议'],
                   'query': ['我要查询', '查询', '我要查看', '查看', '搜索', '查一下', '找一下', '打开'],
                   'greetings': ['你好', '你好啊']
                   }
    field_word = {'property_pay': ['物业缴费', '物业费账单', '物业费'],
                  'complain_order': ['投诉工单', '投诉信息', '我的投诉', '建议工单', '投诉进展'],
                  'repairs_order': ['报修工单', '报修信息', '报修', '报事工单', '报修进展'],
                  'common_phone': ['常用电话', '物业电话', '投诉电话', '物业客服电话', '物业常用电话', '电话'],
                  'property_activitie': ['物业活动'],
                  'shop_order': ['商城订单', '商城信息', '我的订单', '订单'],
                  'work_order_ex': ['工单', '信息', '客服', '我的工单']
                  }

    return intend_word, field_word
# 10


def get_word_inverted_index():
    intend_word1 = {
        # 报修
        '我要报修': ['报修'],
        '报修': ['报修'],
        '报事': ['报修'],
        '我想报事': ['报修'],
        '想报事': ['报修'],
        '我要报事': ['报修'],
        '我想报修': ['报修'],
        '想报修': ['报修'],
        '我报修': ['报修'],
        '我想要报事': ['报修'],
        '我想要报修': ['报修'],
        '想要报修': ['报修'],
        '想要报事': ['报修'],
        '要报事': ['报修'],
        '要报修': ['报修'],
        '帮报修': ['报修'],
        '帮报事': ['报修'],
        '帮忙报事': ['报修'],
        '帮忙报修': ['报修'],
        '帮我报修': ['报修'],
        '帮我报事': ['报修'],

        # 投诉
        '我要投诉': ['投诉'],
        '我想投诉': ['投诉'],
        '投诉': ['投诉'],
        '建议下': ['投诉'],
        '投诉一下': ['投诉'],
        '投诉下': ['投诉'],
        '建议一下': ['投诉'],
        '建议': ['投诉'],
        '想投诉': ['投诉'],
        '想建议': ['投诉'],
        '我想建议': ['投诉'],
        '要建议': ['投诉'],
        '要投诉': ['投诉'],
        '我投诉': ['投诉'],
        '我建议': ['投诉'],
        '我想要建议': ['投诉'],
        '我想要投诉': ['投诉'],
        '我要建议': ['投诉'],
        '想要建议': ['投诉'],
        '想要投诉': ['投诉'],
        '帮投诉': ['投诉'],
        '帮建议': ['投诉'],
        '帮忙建议': ['投诉'],
        '帮忙投诉': ['投诉'],
        '帮我投诉': ['投诉'],
        '帮我建议': ['投诉'],

        # 查询 7
        '我想要查询一下': ['查询'],
        '我想要搜索一下': ['查询'],
        '我想要查找一下': ['查询'],
        # 查询 6
        '想要查询一下': ['查询'],
        '帮我查找一下': ['查询'],
        '帮忙查找一下': ['查询'],
        '帮我查询一下': ['查询'],
        '我想查询一下': ['查询'],
        '我想查找一下': ['查询'],
        '我要搜索一下': ['查询'],
        '我想要搜一搜': ['查询'],
        # 查询 5
        '想要查询下': ['查询'],
        '帮我查询下': ['查询'],
        '帮我查找下': ['查询'],
        '帮忙查找下': ['查询'],
        '我要查找下': ['查询'],
        '我要查询下': ['查询'],
        '我想搜一搜': ['查询'],
        '我要搜一搜': ['查询'],
        # 查询 4
        '想要查询': ['查询'],
        '帮我查找': ['查询'],
        '帮我查下': ['查询'],
        '帮忙查下': ['查询'],
        '帮我找下': ['查询'],
        '帮我查询': ['查询'],
        '帮我查看': ['查询'],
        '帮我查查': ['查询'],
        '帮我看看': ['查询'],
        '帮我找找': ['查询'],
        '我要查询': ['查询'],
        '我要查找': ['查询'],
        '我要找下': ['查询'],
        '我要查下': ['查询'],
        '我要查看': ['查询'],
        '我要查查': ['查询'],
        '我要搜索': ['查询'],
        '我想知道': ['查找'],
        '我想找下': ['查询'],
        '我想查找': ['查询'],
        '查看一下': ['查询'],
        '查找一下': ['查询'],
        '查询一下': ['查询'],
        '想要查看': ['查询'],
        '想要看下': ['查询'],
        '想要查下': ['查询'],
        '想搜一搜': ['查询'],
        # 查询 3
        '帮我找': ['查询'],
        '帮我查': ['查询'],
        '帮忙查': ['查询'],
        '我要找': ['查询'],
        '我想找': ['查询'],
        '我要查': ['查询'],
        '查找下': ['查询'],
        '要查找': ['查询'],
        '要查询': ['查询'],
        '要查下': ['查询'],
        '查一下': ['查询'],
        '找一下': ['查询'],
        '搜一搜': ['查询'],
        '查看下': ['查询'],
        '查询下': ['查询'],
        '我查询': ['查询'],
        '我查找': ['查询'],
        '我找找': ['查询'],
        '我查看': ['查询'],
        '想要查': ['查询'],
        '想要找': ['查询'],
        '想要看': ['查询'],
        # 查询 2
        '想看': ['查询'],
        '查查': ['查询'],
        '查询': ['查询'],
        '查看': ['查询'],
        '查下': ['查询'],
        '查找': ['查询'],
        '找下': ['查询'],
        '找找': ['查询'],
        '打开': ['查询'],
        '搜索': ['查询'],
        '搜搜': ['查询'],
        # 查询 1
        '找': ['查询'],
        '查': ['查询'],
        '看': ['查询'],
        '搜': ['查询'],

        '买': ['购买'],
        '要': ['购买'],
        '要买': ['购买'],
        '购买': ['购买'],
        '想买': ['购买'],
        '想购买': ['购买'],
        '要购买': ['购买'],
        '我要买': ['购买'],
        '我想买': ['购买'],
        '我想要买': ['购买'],
        '我要购买': ['购买'],
        '我想要购买': ['购买'],

    }
    field_word1 = {
        # 物业缴费
        '物业账单': ['物业缴费'],
        '物业缴费': ['物业缴费'],
        '物业费账单': ['物业缴费'],
        '物业费': ['物业缴费'],
        '缴费': ['物业缴费'],
        '缴费账单': ['物业缴费'],
        '账单': ['物业缴费'],
        # 投诉工单
        '投诉': ['投诉/建议工单'],
        '建议': ['投诉/建议工单'],
        '投诉工单': ['投诉/建议工单'],
        '投诉单': ['投诉/建议工单'],
        '建议单': ['投诉/建议工单'],
        '投诉信息': ['投诉/建议工单'],
        '我的投诉': ['投诉/建议工单'],
        '建议工单': ['投诉/建议工单'],
        '投诉进展': ['投诉/建议工单'],
        # 报修工单
        '报修工单': ['报修/报事工单'],
        '报修信息': ['报修/报事工单'],
        '报修': ['报修/报事工单'],
        '报事工单': ['报修/报事工单'],
        '报修进展': ['报修/报事工单'],
        '维修工单': ['报修/报事工单'],
        '报修单': ['报修/报事工单'],
        '报事单': ['报修/报事工单'],
        # 常用电话
        '物业缴费电话': ['常用电话'],
        '常用电话': ['常用电话'],
        '物业电话': ['常用电话'],
        '投诉电话': ['常用电话'],
        '物业客服电话': ['常用电话'],
        '物业常用电话': ['常用电话'],
        '维修电话': ['常用电话'],
        '设施维修电话': ['常用电话'],
        '电话': ['常用电话'],
        '联系方式': ['常用电话'],
        '联系电话': ['常用电话'],

        # 物业活动
        '物业活动': ['物业活动'],
        '活动': ['物业活动'],

        # 商城订单
        '商城订单': ['商城订单'],
        '商城信息': ['商城订单'],
        '我的订单': ['商城订单'],
        '订单': ['商城订单'],
        '优惠券': ['优惠券'],

        # 其他
        '工单': ['投诉/建议工单', '报修/报事工单'],
        # '物业': ['物业缴费', '物业活动', '常用电话']
    }

    intend_word = {
        '报修': {
            '我要报修': ['报修'],
            '报修': ['报修'],
            '报事': ['报修']
        },
        '投诉': {
            '我要投诉': ['投诉'],
            '投诉': ['投诉'],
            '建议': ['投诉']
        },
        '查询': {
            '我要查询': ['查询'],
            '查询': ['查询'],
            '我要查看': ['查询'],
            '查看': ['查询'],
            '搜索': ['查询'],
            '查一下': ['查询'],
            '找一下': ['查询'],
            '打开': ['查询']
        }
    }
    field_word = {
        '物业缴费': {
            '物业缴费': ['物业缴费'],
            '物业费账单': ['物业缴费'],
            '物业费': ['物业缴费'],
            '物业': ['物业缴费'],
        },
        '投诉建议工单': {
            '投诉': ['投诉建议工单'],
            '投诉工单': ['投诉建议工单'],
            '投诉信息': ['投诉建议工单'],
            '我的投诉': ['投诉建议工单'],
            '建议工单': ['投诉建议工单'],
            '投诉进展': ['投诉建议工单'],
        },
        '报修工单': {
            '报修工单': ['报修工单'],
            '报修信息': ['报修工单'],
            '报修': ['报修工单'],
            '报事工单': ['报修工单'],
            '报修进展': ['报修工单']
        },
        '常用电话': {
            '物业缴费电话': ['常用电话'],
            '常用电话': ['常用电话'],
            '物业电话': ['常用电话'],
            '投诉电话': ['常用电话'],
            '物业客服电话': ['常用电话'],
            '物业常用电话': ['常用电话'],
            '电话': ['常用电话']
        },
        '物业活动': {
            '物业活动': ['物业活动']
        },
        '商城订单': {
            '商城订单': ['商城订单'],
            '商城信息': ['商城订单'],
            '我的订单': ['商城订单'],
            '订单': ['商城订单']
        },
        '其他': {
            '工单': ['投诉建议工单', '报修工单'],
            '物业': ['物业缴费', '物业活动', '常用电话']
        }
    }

    intend_word_divide = {}
    for key in intend_word1.keys():
        key_temp = intend_word1[key][0]
        if key_temp not in intend_word_divide.keys():
            intend_word_divide[key_temp] = [key]
        else:
            intend_word_divide[key_temp] = intend_word_divide[key_temp] + [key]

    return intend_word1, field_word1, intend_word_divide


def get_score_field_intent(word):
    """

    :param word:
    :return:
    """
    score_filed = {
        '物业账单': 3,
        '联系方式': 5,
        '联系电话': 5,
        '物业缴费': 3,
        '物业费账单': 3,
        '物业费': 3,
        '缴费': 3,
        '缴费账单': 3,
        '投诉': 1,
        '建议': 1,
        '投诉工单': 3,
        '投诉信息': 3,
        '我的投诉': 3,
        '物业': 1,
        '建议工单': 3,
        '投诉进展': 3,
        '工单': 1,
        '报修工单': 3,
        '报修信息': 3,
        '报修': 1,
        '报事工单': 3,
        '报修进展': 3,
        '物业缴费电话': 3,
        '常用电话': 3,
        '物业电话': 3,
        '投诉电话': 3,
        '电话': 5,
        '维修电话': 3,
        '设施维修电话': 3,
        '物业常用电话': 3,
        '物业客服电话': 3,
        '物业活动': 3,
        '活动': 1,
        '账单': 3,
        '报修单': 3,
        '报事单': 3,
        '投诉单': 3,
        '建议单': 3,
        '商城订单': 3,
        '商城信息': 1,
        '我的订单': 3,
        '订单': 3,
        '优惠券': 3,
    }
    if word not in score_filed.keys():
        return 0
    return score_filed[word]


def get_score_page_intent(word):
    """
    这里定义每个意图词和领域词的分值
    :return:
    """
    word_dir = {
        # 意图分值
        '报修': 1,
        '投诉': 1,
        '查询': 1,
        '物业缴费': 1,
        '投诉/建议工单': 1,
        '报修/报事工单': 1,
        '常用电话': 3,
        '物业活动': 1,
        '商城订单': 1,
        '工单': 1,
        '物业': 1,
    }
    return word_dir[word]


if __name__ == '__main__':
    intend_word_dir, field_word_dir, intend_word_div = get_word_inverted_index()
    print(intend_word_div)
    """
    整个逻辑为：
    1、样例输入
    2、判断是否为空
    3、不为空时执行
    4、将意图字典和样例输入返回意图
    5、对意图进行报修和投诉判断，（不空则赋值
    6、若为查询业务，那么从样例中去除意图词后作为新的样例
    7、将领域词字典和新的样例输入返回最大匹配的领域，
    8、若不空则赋值
    9、最后输出
    """
    """
    # 同义词替换
    1、将样例输入
    2、使用反向索引直接将同义词替换为领域词或者意图词
    4、输出作为新的样例
    """

