# -*- encoding=utf-8 -*-


class SetParameter(object):
    def __init__(self):
        self.intent_code_dir = {'问候语': 0,
                                '报修': 1,
                                '报事报修': 1,
                                '家居报修': 1,
                                '投诉': 2,
                                '投诉建议': 2,
                                '建议与投诉': 2,
                                '查询': 3,
                                '购买': 4,
                                '商品搜索': 4}
        self.field_code_dir = {'商城订单': 1,
                               '物业活动': 2,
                               '常用电话': 3,
                               '查询电话号码': 3,
                               '报修/报事工单': 4,
                               '投诉/建议工单': 5,
                               '物业缴费': 6,
                               '优惠券': 7,
                               }
        self.except_code_dir = {'101异常': 101,  # '查询'意图明确，但未能识别查询内容
                                '102异常': 102,  # '查询'意图明确，但查询内容模糊如：工单、物业
                                '100异常': 100,  # 意图无法识别
                                '100电话异常': 100  # 电话逻辑异常
                                }
        self.except_TipTxt_100 = '小信没有理解您的意思。您可以这样说：' \
                                 '我要报修+【内容】' \
                                 '我要投诉+【内容】' \
                                 '我要查询+【投诉/报修】进展' \
                                 '我要查询+【商城订单】' \
                                 '我要查询+【物业常用电话】'
        self.clf_models = {'MultinomialNB': 'MultinomialNB',
                           'LogisticRegression': 'LogisticRegression',
                           'SVM': 'SVM',
                           'RandomForestClassifier': 'RandomForestClassifier'}  # 三种模型的名称
        self.alpha = {'家居报修': 0.9, '建议与投诉': 0.9, '商品搜索': 0.99, '查询电话号码': 0.9, '问候语': 0.9, '不可识别': 0.9}  # 文本分类的阈值
        self.except_TipTxt_101 = '您可以查询:物业活动、物业电话、物业缴费、商城订单、优惠券、报修/报事工单和投诉/建议工单'
        self.except_TipTxt_102 = '您可以查询:'
        self.greet_tiptxt_0 = '您好，小信正在为您服务'
        self.greet1_tiptxt_0 = '，小信正在为您服务'
        self.punc = ['.', ',', '，', '！', '？', '。', '＂', '：', ':', '!', '＃', '＄', '％', '＆', '＇', '（', '）', '＊',
                     '＋', '，', '－', '／', '：', '；', '＜', '＝', '＞', '＠', '［', '＼', '］', '＾',
                     '＿', '｀', '｛', '｜', '｝', '～', '｟', '｠', '｢', '｣', '､', '、', '〔', '〕',
                     '〖', '〗', '〘', '〙', '〚', '〛', '〜', '〝', '〞', '〟', '〰', '〾', '〿', '–',
                     '—', '‘', '’', '‛', '“', '”', '„', '‟', '…', '‧', '﹏', '.', ' ', '的']  # 标点符号
        self.greet_time_list = ['上午好', '下午好', '晚上好',
                                '中午好', '早晨好', '早上好',
                                '早安', '午安', '晚安']  # 带有时间的问候语
